# Import Libraries

In [2]:
import pandas as pd
import numpy as np
import os

# Import data and create path

In [3]:
df = pd.read_csv(r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis\02 Data\Original Data\orders.csv', index_col = False)

In [26]:
path = r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis'

In [9]:
df_ords = df

In [10]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [11]:
df = pd.read_csv(r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis\02 Data\Original Data\products.csv', index_col = False)

In [12]:
df_prods = df

In [13]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

# Mixed data types

In [16]:
df_test = pd.DataFrame()  #create a dataframe with mixed data types in one column

In [17]:
df_test['mix'] = ['a', 'b', 1, True]

In [19]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [24]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)  #checking whether a dataframe contains any mixed-type columns

mix

In [25]:
df_test['mix'] = df_test['mix'].astype('str')

# Finding missing values

In [31]:
df_prods.isnull().sum()  #checking on how many values are missing per column

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [32]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]  #creating a dataset that shows missing product_name entries

In [33]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [36]:
df.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [38]:
df_prods.shape  #number of rows and colums

(49693, 5)

In [39]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]  #creating a new dataframe without missing values

In [40]:
df_prods_clean.shape  #number of rows and colums

(49677, 5)

# Finding duplicates

In [42]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]  #finding duplicates and creating dataframe with duplicate entries only

In [43]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [44]:
df_prods_clean.shape  #checking no of columns and rows

(49677, 5)

In [45]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()  #creating dataframe without duplicates

In [47]:
df_prods_clean_no_dups.shape   #checking no of columns and rows

(49672, 5)

In [48]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))  #exporting data

# 4.5 Import wrangled orders data

In [7]:
df = pd.read_csv(r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis\02 Data\Prepared Data\orders_wrangled.csv', index_col = False)

In [5]:
df_ords_wrangled = df

In [6]:
df_ords_wrangled.head()  #checking dataframe

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [8]:
df_ords_wrangled.drop(columns = ['Unnamed: 0'])  #removing column 'Unnamed: 0'

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [11]:
df_ords_wrangled = df_ords_wrangled.drop(columns = ['Unnamed: 0'])  #overriding dataframe with this change

In [12]:
df_ords_wrangled.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

# 4.5.3 Check for mixed-type data in your df_ords dataframe.

In [16]:
for col in df_ords_wrangled.columns.tolist():
  weird = (df_ords_wrangled[[col]].applymap(type) != df_ords_wrangled[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords_wrangled[weird]) > 0:
    print (col)  #checking dataframe for mixed data types, of which there aren't any

# 4.5.5 Run a check for missing values in your df_ords dataframe. In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [17]:
df_ords_wrangled.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

There are over 200k missing values in the 'days_since_prior_order' column, which could mean that those entries refelct first-time orders.

# 4.5.6 Address the missing values using an appropriate method. In a markdown cell, explain why you used your method of choice.

In [19]:
df_nan = df_ords_wrangled[df_ords_wrangled['days_since_prior_order'].isnull() == True]  #creating new dataframe to review missing variables

In [20]:
df_nan.head(20)

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
50,2086598,6,1,5,18,NaN
54,2565571,7,1,3,9,NaN
75,600894,8,1,6,0,NaN
79,280530,9,1,1,17,NaN
83,1224907,10,1,2,14,NaN
89,2411567,11,1,0,11,NaN
97,1483446,12,1,1,12,NaN
103,2618231,13,1,6,12,NaN
116,2906263,14,1,2,18,NaN
130,2514324,15,1,5,13,NaN
153,1273676,16,1,2,8,NaN
160,1737705,17,1,2,13,NaN
201,2780889,18,1,6,18,NaN
208,1321974,19,1,6,13,NaN
218,947722,20,1,1,10,NaN

In [21]:
df_ords_wrangled['days_since_prior_order'].fillna(0, inplace=True)  #replace the missing values with 0 based on there not being any prior orders

In [22]:
df_ords_wrangled.isnull().sum()

order_id                  0
user_id                   0
order_number              0
order_day_of_week         0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

Assuming that the missing values represeny first time orders, I chose to replace them with 0 as this would enable me to analyse any trends for first time vs. repeat orders, hence why I would not have removed the missing entries. I would however first validate my assumption before proceeding with this.

# 4.5.7 Run a check for duplicate values in your df_ords data. In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [23]:
df_dups = df_ords_wrangled[df_ords_wrangled.duplicated()]  #checking dataframe for duplicate entries

In [24]:
df_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, order_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

There are not duplicate entries in the df_ords_wrangled.

# 4.5.9 Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [27]:
df_ords_wrangled.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

In [1]:
df_ords_wrangled.describe

NameError: name 'df_ords_wrangled' is not defined